hdscmcu/hc32m120/DeviceDriverLibrary/hc32m120_ddl/driver/src/hc32m120_interrupts.c
/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/
/**
 * @defgroup INTC_Local_Variable INTC Local Variable
 * @{
 */
static func_ptr_t pfnIrqHandler[IRQ_NUM_MAX] = {NULL};
static func_ptr_t pfnNmiCallback;
/**
 * @}
 */

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 * @defgroup INTC_Global_Functions INTC Global Functions
 * @{
 */
/**
 * @brief  IRQ registration function
 * @param  [in] pstcIrqRegiConfig: pointer of IRQ registration structure
 *   @arg  enIntSrc: can be any value except INT_PORT_EIRQ0~7 @ref en_int_src_t
 *   @arg  enIRQn: can be any value from Int008~Int023 @ref IRQn_Type
 *   @arg  pfnCallback: Callback function
 * @retval Ok: IRQ register successfully
 *         ErrorInvalidParameter: IRQ No. and Peripheral Int source are not match;
 *                                Input peripheral Int source cannot be configure;
 *                                NULL pointer.
 */
en_result_t INTC_IrqRegistration(const stc_irq_regi_config_t *pstcIrqRegiConfig)
{
    __IO stc_intc_iselar_field_t *stcIntSel;
    en_result_t enRet = Ok;

    /* Check if pointer is NULL */
    if (NULL == pstcIrqRegiConfig)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Checking validity for Interrupt source of Group 0~7 and IRQ No. */
        if (((pstcIrqRegiConfig->enIntSrc / 0x10u)*2u + 8u != pstcIrqRegiConfig->enIRQn) && \
            ((pstcIrqRegiConfig->enIntSrc / 0x10u)*2u + 9u != pstcIrqRegiConfig->enIRQn))
        {
            enRet = ErrorInvalidParameter;
        }
        else
        {
            /* EIRQ0~7 are fixed allocation of IRQ handler 0~7 */
            if ((0u == pstcIrqRegiConfig->enIntSrc % 0x10u) || (pstcIrqRegiConfig->enIRQn < 8u))
            {
                enRet = ErrorInvalidParameter;
            }
            else
            {
                INTC_Unlock();
                stcIntSel = (stc_intc_iselar_field_t *)((uint32_t)(&M0P_INTC->ISELAR8) +    \
                                                     (4u * (pstcIrqRegiConfig->enIRQn - 8u)));
                stcIntSel->ISEL = (pstcIrqRegiConfig->enIntSrc) % 0x10u;

                /* Callback function */
                pfnIrqHandler[pstcIrqRegiConfig->enIRQn-8u] = pstcIrqRegiConfig->pfnCallback;

                INTC_Lock();
            }
        }
    }
    return enRet;
}

/**
 * @brief  Share IRQ configure
 * @param  [in] enIntSrc: Peripheral interrupt source @ref en_int_src_t
 * @param  [in] enNewState:
 *   @arg  Enable: Enable corresponding peripheral interrupt in share IRQ handler
 *   @arg  Disable: Disable corresponding peripheral interrupt in share IRQ handler
 * @retval Ok: Share IRQ configure successfully
 *         ErrorInvalidParameter: EXINT00~07 cannot be configured into share IRQ handler
 */
en_result_t INTC_ShareIrqCmd(en_int_src_t enIntSrc, en_functional_state_t enNewState)
{
    __IO uint32_t *ISELRx;
    en_result_t enRet = Ok;

    /* EXINT0~7 cannot be configured into share IRQ */
    if (0u == enIntSrc % 0x10u)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        INTC_Unlock();
        ISELRx = (uint32_t *)(((uint32_t)&M0P_INTC->ISELBR24) + (4u * (enIntSrc / 16u)));
        if (Enable == enNewState)
        {
            SET_REG32_BIT(*ISELRx, (1ul << (enIntSrc % 16ul)));
        }
        else
        {
            CLEAR_REG32_BIT(*ISELRx, (1ul << (enIntSrc % 16ul)));
        }
        INTC_Lock();
    }
    return enRet;
}

/**
 * @brief  Stop mode wake-up source configure
 * @param  [in] u32WakeupSrc: Wake-up source
 *   @arg  INTC_WUPENR_EIRQWUEN
 *   @arg  INTC_WUPENR_EIRQWUEN_0
 *   @arg  INTC_WUPENR_EIRQWUEN_1
 *   @arg  INTC_WUPENR_EIRQWUEN_2
 *   @arg  INTC_WUPENR_EIRQWUEN_3
 *   @arg  INTC_WUPENR_EIRQWUEN_4
 *   @arg  INTC_WUPENR_EIRQWUEN_5
 *   @arg  INTC_WUPENR_EIRQWUEN_6
 *   @arg  INTC_WUPENR_EIRQWUEN_7
 *   @arg  INTC_WUPENR_EIRQWUEN_8
 *   @arg  INTC_WUPENR_EIRQWUEN_9
 *   @arg  INTC_WUPENR_SWDTWUEN
 *   @arg  INTC_WUPENR_EKEYWUEN
 *   @arg  INTC_WUPENR_TMR0CMPWUEN
 *   @arg  INTC_WUPENR_PVDWUEN
 *   @arg  INTC_WUPENR_RTCALMWUEN
 *   @arg  INTC_WUPENR_RTCPRDWUEN
 * @param  [in] enNewState
 *   @arg  Enable: Enable corresponding wake up source
 *   @arg  Disable: Disable corresponding wake up source
 * @retval None
 */
void INTC_WakeupSrcCmd(uint32_t u32WakeupSrc, en_functional_state_t enNewState)
{
    /* Parameter validity checking */
    DDL_ASSERT(IS_INTC_WKUP_SRC(u32WakeupSrc));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    INTC_Unlock();
    if (Enable == enNewState)
    {
        SET_REG32_BIT(M0P_INTC->WUPENR, u32WakeupSrc);
    }
    else
    {
        CLEAR_REG32_BIT(M0P_INTC->WUPENR, u32WakeupSrc);
    }
    INTC_Lock();
}

/**
 * @brief  Event or Interrupt output configure
 * @param  [in] u8Event: Event index
 *   @arg  INTC_EVTER_EVTEN0
 *   @arg  INTC_EVTER_EVTEN1
 *   @arg  INTC_EVTER_EVTEN2
 *   @arg  INTC_EVTER_EVTEN3
 *   @arg  INTC_EVTER_EVTEN4
 *   @arg  INTC_EVTER_EVTEN5
 *   @arg  INTC_EVTER_EVTEN6
 *   @arg  INTC_EVTER_EVTEN7
 * @param  [in] enNewState
 *   @arg  Enable: Enable corresponding event to NVIC
 *   @arg  Disable: Disable corresponding event but interrupt to NVIC
 * @retval None
 */
void INTC_EventCmd(uint8_t u8Event, en_functional_state_t enNewState)
{
    /* Parameter validity checking */
    DDL_ASSERT(IS_INTC_EVENT(u8Event));

    INTC_Unlock();
    if (Enable == enNewState)
    {
        SET_REG8_BIT(M0P_INTC->EVTER, u8Event);
    }
    else
    {
        CLEAR_REG8_BIT(M0P_INTC->EVTER, u8Event);
    }
    INTC_Lock();
}

/**
 * @brief  Initialize NMI. Fill each pstcNmiConfig with default value
 * @param  [in] pstcNmiConfig: Pointer to a stc_nmi_config_t structure that
 *                             contains configuration information.
 * @retval Ok: NMI structure initialize successful
 *         ErrorInvalidParameter: NULL pointer
 */
en_result_t NMI_StructInit(stc_nmi_config_t *pstcNmiConfig)
{
    en_result_t enRet = Ok;

