hdscmcu/hc32m120/DeviceDriverLibrary/hc32m120_ddl/driver/src/hc32m120_interrupts.c
    /* External interrupt 09 */
    u32Tmp1 = bM0P_INTC->EIRQFR_b.EIRQF9;
    if ((ISELBR25 & BIT_MASK_01) && (u32Tmp1))
    {
        Extint09_IrqHandler();
    }
    /* DMA Ch.1 transfer complete  */
    if (Reset == bM0P_DMA->INTMASK1_b.MSKTC1)
    {
        if ((bM0P_DMA->INTSTAT1_b.TC1) && (ISELBR25 & BIT_MASK_02))
        {
            DmaTc1_IrqHandler();
        }
    }
    /* DMA Ch.1 block transfer complete  */
    if (Reset == bM0P_DMA->INTMASK1_b.MSKBTC1)
    {
        if ((bM0P_DMA->INTSTAT1_b.BTC1) && (ISELBR25 & BIT_MASK_03))
        {
            DmaBtc1_IrqHandler();
        }
    }
    /* Clock trimming error */
    u32Tmp1 = M0P_CTC->STR & (CTC_STR_TRMOVF | CTC_STR_TRMUDF);
    u32Tmp2 = bM0P_CTC->CR1_b.ERRIE;
    if ((ISELBR25 & BIT_MASK_04) && (u32Tmp1) && (u32Tmp2))
    {
        ClockTrimErr_IrqHandler();
    }
    /* USART1 Rx end */
    u32Tmp1 = bM0P_USART1->SR_b.RXNE;
    u32Tmp2 = bM0P_USART1->CR1_b.RIE;
    if ((ISELBR25 & BIT_MASK_12) && (u32Tmp1) && (u32Tmp2))
    {
        Usart1RxEnd_IrqHandler();
    }
}

/**
 * @brief  Interrupt No.026 share IRQ handler
 * @param  None
 * @retval None
 */
void IRQ026_Handler(void)
{
    uint32_t u32Tmp1 = 0ul;
    uint32_t u32Tmp2 = 0ul;
    uint32_t ISELBR26 = M0P_INTC->ISELBR26;

    /* DMA request or transfer error */
    u32Tmp1 = M0P_DMA->INTSTAT0 & (DMA_INTSTAT0_TRNERR | DMA_INTSTAT0_REQERR);
    u32Tmp2 = (uint32_t)(~(M0P_DMA->INTMASK0) & (DMA_INTMASK0_MSKTRNERR | DMA_INTMASK0_MSKREQERR));
    if ((ISELBR26 & BIT_MASK_01) && (u32Tmp1 & u32Tmp2))
    {
        DmaErr_IrqHandler();
    }
    /* Timer4 U phase higher compare match */
    u32Tmp1 = bM0P_TMR4->OCSRU_b.OCFH;
    u32Tmp2 = bM0P_TMR4->OCSRU_b.OCIEH;
    if ((ISELBR26 & BIT_MASK_02) && (u32Tmp1) && (u32Tmp2))
    {
        Timer4GCMUH_IrqHandler();
    }
    /* Timer4 U phase lower compare match */
    u32Tmp1 = bM0P_TMR4->OCSRU_b.OCFL;
    u32Tmp2 = bM0P_TMR4->OCSRU_b.OCIEL;
    if ((ISELBR26 & BIT_MASK_03) && (u32Tmp1) && (u32Tmp2))
    {
        Timer4GCMUL_IrqHandler();
    }
    /* Timer4 V phase higher compare match */
    u32Tmp1 = bM0P_TMR4->OCSRV_b.OCFH;
    u32Tmp2 = bM0P_TMR4->OCSRV_b.OCIEH;
    if ((ISELBR26 & BIT_MASK_04) && (u32Tmp1) && (u32Tmp2))
    {
        Timer4GCMVH_IrqHandler();
    }
    /* Timer4 V phase lower compare match */
    u32Tmp1 = bM0P_TMR4->OCSRV_b.OCFL;
    u32Tmp2 = bM0P_TMR4->OCSRV_b.OCIEL;
    if ((ISELBR26 & BIT_MASK_05) && (u32Tmp1) && (u32Tmp2))
    {
        Timer4GCMVL_IrqHandler();
    }
    /* Timer4 W phase higher compare match */
    u32Tmp1 = bM0P_TMR4->OCSRW_b.OCFH;
    u32Tmp2 = bM0P_TMR4->OCSRW_b.OCIEH;
    if ((ISELBR26 & BIT_MASK_06) && (u32Tmp1) && (u32Tmp2))
    {
        Timer4GCMWH_IrqHandler();
    }
    /* Timer4 W phase lower compare match */
    u32Tmp1 = bM0P_TMR4->OCSRW_b.OCFL;
    u32Tmp2 = bM0P_TMR4->OCSRW_b.OCIEL;
    if ((ISELBR26 & BIT_MASK_07) && (u32Tmp1) && (u32Tmp2))
    {
        Timer4GCMWL_IrqHandler();
    }
    /* USART1 Tx buffer empty */
    u32Tmp1 = bM0P_USART1->SR_b.TXE;
    u32Tmp2 = bM0P_USART1->CR1_b.TXEIE;
    if ((ISELBR26 & BIT_MASK_12) && (u32Tmp1) && (u32Tmp2))
    {
        Usart1TxEmpt_IrqHandler();
    }
    /* USART3 Rx ORE/FE/PE error */
    u32Tmp1 = M0P_USART3->SR & (USART_SR_PE | USART_SR_FE | USART_SR_ORE);
    u32Tmp2 = bM0P_USART3->CR1_b.RIE;
    if ((ISELBR26 & BIT_MASK_13) && (u32Tmp1) && (u32Tmp2))
    {
        Usart3RxErr_IrqHandler();
    }
}

/**
 * @brief  Interrupt No.027 share IRQ handler
 * @param  None
 * @retval None
 */
void IRQ027_Handler(void)
{
    uint32_t u32Tmp1 = 0ul;
    uint32_t u32Tmp2 = 0ul;
    uint32_t ISELBR27 = M0P_INTC->ISELBR27;

    /* EKEY and other Interrupt source are exclusive */
    if (BIT_MASK_01 == ISELBR27)
    {
        EKey_IrqHandler();
    }
    else
    {
        /* Timer 0 compare match */
        u32Tmp1 = bM0P_TMR0->STFLR_b.CMFA;
        u32Tmp2 = bM0P_TMR0->BCONR_b.INTENA;
        if ((ISELBR27 & BIT_MASK_02) && (u32Tmp1) && (u32Tmp2))
        {
            Timer0GCmp_IrqHandler();
        }
        /* Timer4 U phase reload */
        u32Tmp1 = bM0P_TMR4->RCSR_b.RTIFU;
        u32Tmp2 = bM0P_TMR4->RCSR_b.RTIDU;
        if ((ISELBR27 & BIT_MASK_04) && (u32Tmp1) && (Reset == u32Tmp2))
        {
            Timer4ReloadU_IrqHandler();
        }
        /* Timer4 V phase reload */
        u32Tmp1 = bM0P_TMR4->RCSR_b.RTIFV;
        u32Tmp2 = bM0P_TMR4->RCSR_b.RTIDV;
        if ((ISELBR27 & BIT_MASK_05) && (u32Tmp1) && (Reset == u32Tmp2))
        {
            Timer4ReloadV_IrqHandler();
        }
        /* Timer4 W phase reload */
        u32Tmp1 = bM0P_TMR4->RCSR_b.RTIFW;
        u32Tmp2 = bM0P_TMR4->RCSR_b.RTIDW;
        if ((ISELBR27 & BIT_MASK_06) && (u32Tmp1) && (Reset == u32Tmp2))
        {
            Timer4ReloadW_IrqHandler();
        }
        /* EMB */
        u32Tmp1 = M0P_EMB->STAT & (EMB_STAT_PORTINF | EMB_STAT_PWMSF |          \
                                   EMB_STAT_CMPF    | EMB_STAT_OSF);
        u32Tmp2 = M0P_EMB->INTEN & (EMB_INTEN_PORTINTEN | EMB_INTEN_PWMINTEN |  \
                                    EMB_INTEN_CMPINTEN  | EMB_INTEN_OSINTEN);
        if ((ISELBR27 & BIT_MASK_07) && (u32Tmp1 & u32Tmp2))
        {
            Emb_IrqHandler();
        }
        /* USART1 Tx end */
        u32Tmp1 = bM0P_USART1->SR_b.TC;
        u32Tmp2 = bM0P_USART1->CR1_b.TCIE;
        if ((ISELBR27 & BIT_MASK_12) && (u32Tmp1) && (u32Tmp2))
        {
            Usart1TxEnd_IrqHandler();
        }
        /* USART3 Rx end */
        u32Tmp1 = bM0P_USART3->SR_b.RXNE;
        u32Tmp2 = bM0P_USART3->CR1_b.RIE;
        if ((ISELBR27 & BIT_MASK_13) && (u32Tmp1) && (u32Tmp2))
        {
            Usart3RxEnd_IrqHandler();
        }
        /* SPI Rx end */
        u32Tmp1 = bM0P_SPI->SR_b.RDFF;
        u32Tmp2 = bM0P_SPI->CR1_b.RXIE;
        if ((ISELBR27 & BIT_MASK_14) && (u32Tmp1) && (u32Tmp2))
        {
            SpiRxEnd_IrqHandler();
        }
    }
}

/**
 * @brief  Interrupt No.028 share IRQ handler
 * @param  None
 * @retval None
 */
void IRQ028_Handler(void)
{
    uint32_t u32Tmp1 = 0ul;
    uint32_t u32Tmp2 = 0ul;
    uint32_t ISELBR28 = M0P_INTC->ISELBR28;

