hdscmcu/hc32m120/DeviceDriverLibrary/hc32m120_ddl/driver/src/hc32m120_interrupts.c
    /* TimerA overflow */
    u32Tmp1 = bM0P_TMRA->BCSTR_b.OVFF;
    u32Tmp2 = bM0P_TMRA->BCSTR_b.INENOVF;
    if ((ISELBR28 & BIT_MASK_01) && (u32Tmp1) && (u32Tmp2))
    {
        TimerAOV_IrqHandler();
    }
    /* TimerA underflow */
    u32Tmp1 = bM0P_TMRA->BCSTR_b.UDFF;
    u32Tmp2 = bM0P_TMRA->BCSTR_b.INENUDF;
    if ((ISELBR28 & BIT_MASK_02) && (u32Tmp1) && (u32Tmp2))
    {
        TimerAUD_IrqHandler();
    }
    /* TimerA compare match */
    u32Tmp1 = M0P_TMRA->STFLR & (uint32_t)(TMRA_STFLR_CMPF1 | TMRA_STFLR_CMPF2);
    u32Tmp2 = M0P_TMRA->ICONR & (uint32_t)(TMRA_ICONR_ITEN1 | TMRA_ICONR_ITEN2);
    if ((ISELBR28 & BIT_MASK_03) && (u32Tmp1 & u32Tmp2))
    {
        TimerACmp_IrqHandler();
    }
    /* Timer4 overflow */
    u32Tmp1 = bM0P_TMR4->CCSR_b.IRQPF;
    u32Tmp2 = bM0P_TMR4->CCSR_b.IRQPEN;
    if ((ISELBR28 & BIT_MASK_04) && (u32Tmp1) && (u32Tmp2))
    {
        Timer4GOV_IrqHandler();
    }
    /* Timer4 underflow */
    u32Tmp1 = bM0P_TMR4->CCSR_b.IRQZF;
    u32Tmp2 = bM0P_TMR4->CCSR_b.IRQZEN;
    if ((ISELBR28 & BIT_MASK_05) && (u32Tmp1) && (u32Tmp2))
    {
        Timer4GUD_IrqHandler();
    }
    /* TimerB3 overflow */
    u32Tmp1 = bM0P_TMRB3->BCSTR_b.OVFF;
    u32Tmp2 = bM0P_TMRB3->BCSTR_b.INENOVF;
    if ((ISELBR28 & BIT_MASK_08) && (u32Tmp1) && (u32Tmp2))
    {
        TimerB3OF_IrqHandler();
    }
    /* TimerB3 underflow */
    u32Tmp1 = bM0P_TMRB3->BCSTR_b.UDFF;
    u32Tmp2 = bM0P_TMRB3->BCSTR_b.INENUDF;
    if ((ISELBR28 & BIT_MASK_09) && (u32Tmp1) && (u32Tmp2))
    {
        TimerB3UF_IrqHandler();
    }
    /* TimerB4 compare match */
    u32Tmp1 = bM0P_TMRB4->STFLR_b.CMPF1;
    u32Tmp2 = bM0P_TMRB4->ICONR_b.ITEN1;
    if ((ISELBR28 & BIT_MASK_10) && (u32Tmp1) && (u32Tmp2))
    {
        TimerB4Cmp_IrqHandler();
    }
    /* ADC seq.A convert complete */
    u32Tmp1 = bM0P_ADC->ISR_b.EOCAF;
    u32Tmp2 = bM0P_ADC->ICR_b.EOCAIEN;
    if ((ISELBR28 & BIT_MASK_11) && (u32Tmp1) && (u32Tmp2))
    {
        AdcSeqA_IrqHandler();
    }
    /* USART2 Rx ORE/FE/PE error */
    u32Tmp1 = M0P_USART2->SR & (USART_SR_PE | USART_SR_FE | USART_SR_ORE);
    u32Tmp2 = bM0P_USART2->CR1_b.RIE;
    if ((ISELBR28 & BIT_MASK_12) && (u32Tmp1) && (u32Tmp2))
    {
        Usart2RxErr_IrqHandler();
    }
    /* USART3 Tx buffer empty */
    u32Tmp1 = bM0P_USART3->SR_b.TXE;
    u32Tmp2 = bM0P_USART3->CR1_b.TXEIE;
    if ((ISELBR28 & BIT_MASK_13) && (u32Tmp1) && (u32Tmp2))
    {
        Usart3TxEmpt_IrqHandler();
    }
    /* I2c Tx buffer empty */
    u32Tmp1 = bM0P_I2C->SR_b.TEMPTYF;
    u32Tmp2 = bM0P_I2C->CR2_b.TEMPTYIE;
    if ((ISELBR28 & BIT_MASK_14) && (u32Tmp1) && (u32Tmp2))
    {
        I2cTxEmpt_IrqHandler();
    }
    /* SPI bus idle */
    u32Tmp1 = bM0P_SPI->SR_b.IDLNF;
    u32Tmp2 = bM0P_SPI->CR1_b.IDIE;
    if ((ISELBR28 & BIT_MASK_15) && (u32Tmp1) && (u32Tmp2))
    {
        SpiIdle_IrqHandler();
    }
}

/**
 * @brief  Interrupt No.029 share IRQ handler
 * @param  None
 * @retval None
 */
void IRQ029_Handler(void)
{
    uint32_t u32Tmp1 = 0ul;
    uint32_t u32Tmp2 = 0ul;
    uint32_t ISELBR29 = M0P_INTC->ISELBR29;

    /* Timer2 compare match */
    u32Tmp1 = bM0P_TMR2->STFLR_b.CMFA;
    u32Tmp2 = bM0P_TMR2->ICONR_b.CMENA;
    if ((ISELBR29 & BIT_MASK_02) && (u32Tmp1) && (u32Tmp2))
    {
        Timer2GCmp_IrqHandler();
    }
    /* Timer2 overflow */
    u32Tmp1 = bM0P_TMR2->STFLR_b.OVFA;
    u32Tmp2 = bM0P_TMR2->ICONR_b.OVENA;
    if ((ISELBR29 & BIT_MASK_03) && (u32Tmp1) && (u32Tmp2))
    {
        Timer2GOV_IrqHandler();
    }
    /* TimerB4 overflow */
    u32Tmp1 = bM0P_TMRB4->BCSTR_b.OVFF;
    u32Tmp2 = bM0P_TMRB4->BCSTR_b.INENOVF;
    if ((ISELBR29 & BIT_MASK_08) && (u32Tmp1) && (u32Tmp2))
    {
        TimerB4OF_IrqHandler();
    }
    /* TimerB4 underflow */
    u32Tmp1 = bM0P_TMRB4->BCSTR_b.UDFF;
    u32Tmp2 = bM0P_TMRB4->BCSTR_b.INENUDF;
    if ((ISELBR29 & BIT_MASK_09) && (u32Tmp1) && (u32Tmp2))
    {
        TimerB4UF_IrqHandler();
    }
    /* TimerB3 compare match */
    u32Tmp1 = bM0P_TMRB3->STFLR_b.CMPF1;
    u32Tmp2 = bM0P_TMRB3->ICONR_b.ITEN1;
    if ((ISELBR29 & BIT_MASK_10) && (u32Tmp1) && (u32Tmp2))
    {
        TimerB3Cmp_IrqHandler();
    }
    /* ADC seq.B convert complete */
    u32Tmp1 = bM0P_ADC->ISR_b.EOCBF;
    u32Tmp2 = bM0P_ADC->ICR_b.EOCBIEN;
    if ((ISELBR29 & BIT_MASK_11) && (u32Tmp1) && (u32Tmp2))
    {
        AdcSeqB_IrqHandler();
    }
    /* USART2 Rx end */
    u32Tmp1 = bM0P_USART2->SR_b.RXNE;
    u32Tmp2 = bM0P_USART2->CR1_b.RIE;
    if ((ISELBR29 & BIT_MASK_12) && (u32Tmp1) && (u32Tmp2))
    {
        Usart2RxEnd_IrqHandler();
    }
    /* USART3 Tx end */
    u32Tmp1 = bM0P_USART3->SR_b.TC;
    u32Tmp2 = bM0P_USART3->CR1_b.TCIE;
    if ((ISELBR29 & BIT_MASK_13) && (u32Tmp1) && (u32Tmp2))
    {
        Usart3TxEnd_IrqHandler();
    }
    /* I2c Rx end */
    u32Tmp1 = bM0P_I2C->SR_b.RFULLF;
    u32Tmp2 = bM0P_I2C->CR2_b.RFULLIE;
    if ((ISELBR29 & BIT_MASK_14) && (u32Tmp1) && (u32Tmp2))
    {
        I2cRxEnd_IrqHandler();
    }
}

/**
 * @brief  Interrupt No.030 share IRQ handler
 * @param  None
 * @retval None
 */
void IRQ030_Handler(void)
{
    uint32_t u32Tmp1 = 0ul;
    uint32_t u32Tmp2 = 0ul;
    uint32_t ISELBR30 = M0P_INTC->ISELBR30;

    /* TimerB1 overflow */
    u32Tmp1 = bM0P_TMRB1->BCSTR_b.OVFF;
    u32Tmp2 = bM0P_TMRB1->BCSTR_b.INENOVF;
    if ((ISELBR30 & BIT_MASK_08) && (u32Tmp1) && (u32Tmp2))
    {
        TimerB1OF_IrqHandler();
    }
    /* TimerB1 underflow */
    u32Tmp1 = bM0P_TMRB1->BCSTR_b.UDFF;
    u32Tmp2 = bM0P_TMRB1->BCSTR_b.INENUDF;
    if ((ISELBR30 & BIT_MASK_09) && (u32Tmp1) && (u32Tmp2))
    {
        TimerB1UF_IrqHandler();
    }
    /* TimerB2 compare match */
    u32Tmp1 = bM0P_TMRB2->STFLR_b.CMPF1;
    u32Tmp2 = bM0P_TMRB2->ICONR_b.ITEN1;
    if ((ISELBR30 & BIT_MASK_10) && (u32Tmp1) && (u32Tmp2))
    {
        TimerB2Cmp_IrqHandler();
    }
    /* ADC convert result in range of window 0 setting */
    u32Tmp1 = bM0P_ADC->AWDSR_b.AWD0F;
    u32Tmp2 = bM0P_ADC->AWDCR_b.AWD0IEN;
    if ((ISELBR30 & BIT_MASK_11) && (u32Tmp1) && (u32Tmp2))
    {
        AdcCmp0_IrqHandler();
    }
    /* USART2 Tx buffer empty */
    u32Tmp1 = bM0P_USART2->SR_b.TXE;
    u32Tmp2 = bM0P_USART2->CR1_b.TXEIE;
    if ((ISELBR30 & BIT_MASK_12) && (u32Tmp1) && (u32Tmp2))
    {
        Usart2TxEmpt_IrqHandler();
    }
    /* I2c Tx end */
    u32Tmp1 = bM0P_I2C->SR_b.TENDF;
    u32Tmp2 = bM0P_I2C->CR2_b.TENDIE;
    if ((ISELBR30 & BIT_MASK_13) && (u32Tmp1) && (u32Tmp2))
    {
        I2cTxEnd_IrqHandler();
    }
}

/**
 * @brief  Interrupt No.031 share IRQ handler
 * @param  None
 * @retval None
 */
void IRQ031_Handler(void)
{
    uint32_t u32Tmp1 = 0ul;
    uint32_t u32Tmp2 = 0ul;
    uint32_t ISELBR31 = M0P_INTC->ISELBR31;

    /* LVD detected */
    if (0u == M0P_EFM->LVDICGCR_f.LVDDIS)
    {
        u32Tmp1 = bM0P_PWC->LVDCSR_b.DETF;
        if ((ISELBR31 & BIT_MASK_02) && (u32Tmp1))
        {
            Lvd_IrqHandler();
        }
    }
    /* EFM operate end */
    if (bM0P_EFM->FITE_b.OPTENDITE)
    {
        u32Tmp1 = bM0P_EFM->FSR_b.OPTEND;
        if ((ISELBR31 & BIT_MASK_04) && (u32Tmp1))
        {
            EfmOpEnd_IrqHandler();
        }
    }
    /* TimerB2 overflow */
    u32Tmp1 = bM0P_TMRB2->BCSTR_b.OVFF;
    u32Tmp2 = bM0P_TMRB2->BCSTR_b.INENOVF;
    if ((ISELBR31 & BIT_MASK_08) && (u32Tmp1) && (u32Tmp2))
    {
        TimerB2OF_IrqHandler();
    }
    /* TimerB2 underflow */
    u32Tmp1 = bM0P_TMRB2->BCSTR_b.UDFF;
    u32Tmp2 = bM0P_TMRB2->BCSTR_b.INENUDF;
    if ((ISELBR31 & BIT_MASK_09) && (u32Tmp1) && (u32Tmp2))
    {
        TimerB2UF_IrqHandler();
    }
    /* TimerB1 compare match */
    u32Tmp1 = bM0P_TMRB1->STFLR_b.CMPF1;
    u32Tmp2 = bM0P_TMRB1->ICONR_b.ITEN1;
    if ((ISELBR31 & BIT_MASK_10) && (u32Tmp1) && (u32Tmp2))
    {
        TimerB1Cmp_IrqHandler();
    }
    if (Set == bM0P_ADC->AWDCR_b.AWD1IEN)
    {
        /* ADC convert result in range of window 1 if independence use */
        u32Tmp1 = bM0P_ADC->AWDSR_b.AWD1F;
        u32Tmp2 = M0P_ADC->AWDCR_f.AWDCM;
        if ((ISELBR31 & BIT_MASK_11) && (u32Tmp1) && (Reset == u32Tmp2))
        {
            AdcCmp1_IrqHandler();
        }
        /* ADC convert result combination use of window 0 & 1 */
        u32Tmp1 = bM0P_ADC->AWDSR_b.AWDCMF;
        if ((ISELBR31 & BIT_MASK_11) && (u32Tmp1) && (Reset != u32Tmp2))
        {
            AdcCmp1_IrqHandler();
        }
    }
    /* USART2 Tx end */
    u32Tmp1 = bM0P_USART2->SR_b.TC;
    u32Tmp2 = bM0P_USART2->CR1_b.TCIE;
    if ((ISELBR31 & BIT_MASK_12) && (u32Tmp1) && (u32Tmp2))
    {
        Usart2TxEnd_IrqHandler();
    }
    /* SPI Tx buffer empty */
    u32Tmp1 = bM0P_SPI->SR_b.TDEF;
    u32Tmp2 = bM0P_SPI->CR1_b.TXIE;
    if ((ISELBR31 & BIT_MASK_13) && (u32Tmp1) && (u32Tmp2))
    {
        SpiTxEmpt_IrqHandler();
    }
}

/**
 * @}
 */

#endif /* DDL_INTERRUPTS_ENABLE */

/**
 * @}
 */

/**
* @}
*/

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/
